docs/software-release-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-01 Thu 13:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Release Guide (CWI CI Group)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jan-Willem Buurlage, Allard Hendriksen" />
</head>
<body>
<div id="content">
<h1 class="title">Software Release Guide (CWI CI Group)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6f40f6a">1. Introduction</a></li>
<li><a href="#org8408838">2. Anatomy of a software project</a>
<ul>
<li><a href="#org8f5cfc2">2.1. Update project structure</a></li>
<li><a href="#org37b1942">2.2. Add documentation</a></li>
<li><a href="#org021d6c8">2.3. Add files for distribution</a></li>
<li><a href="#org71dba4b">2.4. Release the software</a></li>
<li><a href="#orgaf772f8">2.5. Further development</a></li>
<li><a href="#org0ef9cfe">2.6. Putting theory to practice: developing a Python a software package</a>
<ul>
<li><a href="#org70eb583">2.6.1. Set up software project structure</a></li>
<li><a href="#org76771e0">2.6.2. Adding your code</a></li>
<li><a href="#org08f2272">2.6.3. Creating an initial release</a></li>
<li><a href="#org2b8cf33">2.6.4. Further development</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6f40f6a" class="outline-2">
<h2 id="org6f40f6a"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document consists of two parts. In the first part, we suggest useful tools,
a good project structure, and some further guidelines, for sharing your software
projects. In some sense, it is a checklist for your software package to make
sure that it is easy to use for others, yet allows you to keep the freedom to
develop your software further. The second part, <i>selected topics</i>, is a how-to
guide for common tasks that you may need to perform while working on software.
</p>

<p>
These notes are not intended to teach you the basics of programming, source
control, or for example using Linux. Instead, it is about everything you need
<i>after</i> you become a capable programmer, when you start producing software that
becomes useful for others.
</p>

<p>
One question we should answer before diving in deep, is <i>why?</i> Indeed, why
should we put so much effort in our software. We are, after all, scientists &#x2013;
not software developers! We believe there are many reasons why we <i>should</i> take
care in sharing our scientific software, some of them we list below.
</p>

<ul class="org-ul">
<li><b>Collaborations within the group</b>. Although everyone in the CI CWI group are
individual researchers, our work has a lot in common. Most of us work on
algorithms, target the same kind of data set, and often face the same
problems. For example, more often than not, an issue that you are facing has
already been tackled by someone before. Sharing our solutions means not having
to reinvent the wheel. Furthermore, someone else their expertise may push your
research further. Whether this means a new application of a neural network
structure, combining algorithms together for even better reconstructions, or
simply using a method you developed for the reconstruction of data recorded in
our lab.</li>
<li><b>Collaborations with other groups.</b> The CI CWI group takes a unique position
in research &#x2013; somewhere in between the hardcore mathematics, and the more
experimental side of imaging. With our software, we can help bridge the gap
between experimentalists (who are often still using what we consider ancient
methods), and algorithm developers (who can be out of touch with the demands
and requirements of real-world imaging experiments), by working together with
both sides of this spectrum.</li>
<li><b>Publicity</b>. Putting out software that is being used by others gives a lot of
exposure to yourself as a researcher, and the group as a whole. For example,
ASTRA has been an important part of our public identity.</li>
<li><b>Real-world impact of your research.</b> Unfortunately, writing a beautiful
article outlining all the ins and outs of your method does not mean that it
will also be picked up and used by others. Time is scarce for everyone in
science, and anything beyond the most trivial algorithm will most likely not
be reimplemented outside our own research group. Publishing software alongside
an article makes it <i>much</i> easier for others to use and apply your methods.</li>
<li><b>Scientific output.</b> Slowly but surely, software itself is being recognized as
scientific output. There are many journals and conferences dedicated to
scientific software.</li>
</ul>

<p>
It can be intimidating to share your software with colleagues, let alone to
release it to the public. We always want to <i><b>clean up the code, and fix this
last thing</b></i> before we share it. However, especially since very few of us (if
any) are trained as software engineers, it is not always clear what it means to
develop good, or <i>clean</i>, software. This means that a lot of software is kept
private until it is done, and regrettably this often means it is kept private
indefinitely.
</p>

<p>
Hopefully, after reading the next section, you will be fully equipped to turn
your software projects into clear, clean and usable packages. Our intention is
to ease the transition of your project from something that is written primarily
for yourself, to something others can also use.
</p>
</div>
</div>
<div id="outline-container-org8408838" class="outline-2">
<h2 id="org8408838"><span class="section-number-2">2</span> Anatomy of a software project</h2>
<div class="outline-text-2" id="text-2">
<p>
Let us assume that you have developed an image reconstruction algorithm. You
have designed your numerical experiments, and implemented them in Python
(perhaps on top of the ASTRA toolbox).
</p>

<p>
In the most extreme case, the result is a single script. This script contains
for example some classes, functions and some code that applies them to a data
set.
</p>

<p>
Here, we will transform this script into a software package that is installable
and usable by others, and maintainable and testable by you, the developer. We
will take the following steps, which we will explain in detail later. (1)
<b>Update project structure</b>. A software project consists of more than just the
code. In should also include additional files, containing additional information
for the user. (2) <b>Add documentation</b>. Since you developed the software, you
know exactly how it works (and how it doesn't). Unfortunately, your users cannot
read your mind. Minimally, you should provide some basic information on how to
install and use your software, as well as what your users are allowed to do with
it. (3) <b>Add files for distribution</b>. Before you can release your software into
the wild, you need to add build files, and license. (4) <b>Release the software</b>.
With a good structure, documentation and distribution files in place &#x2013; we are
ready for release. We add release notes to the project, and assign a version to
the software. (5) <b>Further development</b>. Unfortunately, having users also means
having some responsibility. Luckily, with the setup we recommend, you can
continue developing your software without frustrating your users by following a
small set of rules.
</p>

<p>
We will first discuss the steps, and it is not written to <i>following along as
you read</i>, but rather to give an overview of what a minimal software package
consists of. After this initial discussion, we will provide you with more detailed
information on how to realize these steps for your software, as most of the
steps can be automated.
</p>
</div>
