docs/software-release-guide.html

<div id="outline-container-org8f5cfc2" class="outline-3">
<h3 id="org8f5cfc2"><span class="section-number-3">2.1</span> Update project structure</h3>
<div class="outline-text-3" id="text-2-1">
<p>
First, we need to convert our code into a clean and predictable structure. The
recommended structure depends mainly on the programming language used. We only
consider Python software for now, but we will discuss other languages later. Our
hypothetical software package will be called <code>hsp</code>, for hypothetical software
package.
</p>

<p>
We will first set up our directory as follows:
</p>
<div class="org-src-container">
<pre class="src src-bash">&#9500;&#9472;&#9472; example
&#9474;&#160;&#160; &#9492;&#9472;&#9472; run_on_data.py
&#9492;&#9472;&#9472; hsp
    &#9500;&#9472;&#9472; hsp.py
    &#9492;&#9472;&#9472; __init__.py
</pre>
</div>

<p>
Here, <code>hsp.py</code> contains functions and classes, while <code>run_on_data.py</code> contains
code applying them to data. Note in bigger projects you can split <code>hsp.py</code>
further into multiple files, grouping them together by functionality. The file
<code>__init__.py</code> ties them together. There can also be multiple examples.
</p>

<p>
With this structure, we can use <code>import hsp</code> from scripts residing at our root
folder. Later we will set our package up so that you can run this import
statement from anywhere.
</p>
</div>
</div>
<div id="outline-container-org37b1942" class="outline-3">
<h3 id="org37b1942"><span class="section-number-3">2.2</span> Add documentation</h3>
<div class="outline-text-3" id="text-2-2">
<p>
There are two classes of documentation. First, there is usually a readme file
called <code>README.md</code>, containing some basic information on the project. Second, detailed
documentation is provided on a separate webpage (hosted online or shipped
alongside the software). We will discuss a good way to set up initial
documentation.
</p>

<p>
The readme file is comparable to the metadata and abstract of an article. It
should provide a potential user with all the information they need to decide
whether to use your software. Like writing good abstracts, writing good readme
documents is an art form. At the minimum, it should contain the following. (1)
The name of your software package, together with a short (one or two sentences)
summary of what it does. (2) Information on how to install the software. If it
is a software library, it is usually a good idea to show a short example of code
written on top of the library. (3) Information on the authors, the license, how
to contribute, and potentially what article to cite if people use your software.
</p>

<p>
The more detailed documentation can contain the README as a landing page, but
typically takes a more <i>tutorial-like</i> approach to describe the software.
Usually, this means explaining how to do some example task with the software, or
explaining the example code that is shipped alongside the library. The example
code itself can also be considered documentation, and can usually be a stripped
down version of the code you use yourself for e.g. numerical experiments.
Furthermore, the documentation should provide an API overview, documenting all
the classes and functions you expose to the user. This overview can be generated
automatically from your code, using function signatures and optional
<i>docstrings</i> that you may have written. For Python projects, we recommend using
Sphinx to generate the documentation.
</p>
</div>
</div>
<div id="outline-container-org021d6c8" class="outline-3">
<h3 id="org021d6c8"><span class="section-number-3">2.3</span> Add files for distribution</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Next, you should allow yourself and your users to use your package by a simple
<code>import</code> statement. For this, you can include a <code>setup.py</code> for <code>setuptools</code>,
allowing your users to do a <code>pip install</code>. You can also add support for <code>conda</code>
by including some basic <code>.yaml</code> files.
</p>

<p>
You should to include a <code>LICENSE.md</code> file letting our users know what they are
allowed to do with our software. Typically, software written by our group is
released under the GPL.
</p>
</div>
</div>
<div id="outline-container-org71dba4b" class="outline-3">
<h3 id="org71dba4b"><span class="section-number-3">2.4</span> Release the software</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Releasing your software does not only mean that it is made available publicly.
It means to provide a fixed, frozen version of the code that has no known bugs,
and to assign it a version number. An initial version number can be <code>v0.0.1</code>.
</p>

<p>
This is an important service to your potential users, because it gives them a
predictable state of your code to fall back on. If you decide to further develop
your code, you can do this freely without worrying about breaking your users'
codes, because they can depend on this fixed release.
</p>

<p>
This brings us to another important file, the release notes, which are contained
in a file <code>CHANGELOG.md</code>. For the initial release, this file does not much
information. Maybe a notice that it is the first public release, and the date at
which it is published. However, as you add, amend, and change your software, you
may want to release a next version, say <code>v0.0.2</code>. In the release notes, you can
let the user know what has changed, and they should be able to see immediately
if they should expect any difficulties when upgrading to the new version.
</p>

<p>
We recommend using GitHub to publish your software. GitHub has a good mechanism
for managing releases. Simply click on the <i>releases</i> button, and create a new
release. Provide a tag, name, and some basic information &#x2013; and GitHub will
automatically mark the current state of the software as a new release. Next, if
it is a Python project, you can upload the new release to Anaconda and/or PyPI.
</p>
</div>
</div>
<div id="outline-container-orgaf772f8" class="outline-3">
<h3 id="orgaf772f8"><span class="section-number-3">2.5</span> Further development</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Now that your software is out in the public, making big changes to your software
probably means breaking your users code. As a courtesy to your users, whenever
you add, change or remove something add a line to your change log describing
what is new.
</p>

<p>
When releasing your new software, choose a new version number according to
semantic versioning. In brief, when choosing a new number <code>vX.Y.Z</code> increment <code>Z</code>
if you are fixing incorrect behaviour, <code>Y</code> if you are adding new functionality
but user code should not break, and <code>X</code> if you make major changes that can break
user code. This gives your users a lot of information on the new release simply
by looking at the version number: they can always safely upgrade to your new
release if <code>X</code> is unchanged, and should check what's new when either <code>X</code> or <code>Y</code>
is increased.
</p>
</div>
</div>
<div id="outline-container-org0ef9cfe" class="outline-3">
<h3 id="org0ef9cfe"><span class="section-number-3">2.6</span> Putting theory to practice: developing a Python a software package</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Instead of performing all the steps outlined above manually, the easiest way to
set up your project correctly is by using the <code>cookiecutter</code> template we
provide.
</p>
</div>
