docs/software-release-guide.html

<div id="outline-container-org70eb583" class="outline-4">
<h4 id="org70eb583"><span class="section-number-4">2.6.1</span> Set up software project structure</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
First, install <code>cookiecutter</code>.
</p>
<div class="org-src-container">
<pre class="src src-bash">pip install -U cookiecutter
</pre>
</div>
<p>
We provide a basic template for Python software packages. You can use this
template to set up a new directory that contains all the files that were
discussed in the previous sections, as well as a mock software project. You can
then copy your code into the Python files that is generated by the template
(for details on how to do this, see below). First, run the following command,
and answer the questions that are asked.
</p>
<div class="org-src-container">
<pre class="src src-bash">cookiecutter https://github.com/cicwi/cookiecutter-cicwi.git
</pre>
</div>
<p>
This will generate a directory with the name of your project. Next, you need to
set up a new GitHub repository. We assume you have made such a repository, and
that it resides at <a href="https://github.com/username/project">https://github.com/username/project</a>, and that the name of
your project is <code>hsp</code>. Next we set up Git.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">cd</span> hsp <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">replace with project name</span>
git init
git remote add github https://github.com/username/project
</pre>
</div>
<p>
To use the template, we require the installation of some dependencies and tools.
We assume that you are inside a <code>conda</code> environment. You can install all the
dependencies by running the following command.
</p>
<div class="org-src-container">
<pre class="src src-bash">make install_dev install
</pre>
</div>
</div>
</div>
<div id="outline-container-org76771e0" class="outline-4">
<h4 id="org76771e0"><span class="section-number-4">2.6.2</span> Adding your code</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
Now that everything is set up, we are ready to copy your code into the project.
Typically, the code you want to share takes the form of a library. In
particular, there are some classes and functions that others can make use of.
Simply copy these classes and functions to <code>hsp/hsp.py</code>. This file contains the
code for your library.
</p>

<p>
It is a good idea to add a minimal example of how to use your library. This
should somehow represent the core functionality of the software and should not
be more than a couple of lines of code. For this, you can edit the file
<code>examples/getting_started.py</code>. Your application code, that for example applies
your library to data, can probably also be converted to an interesting example.
You can add more scripts to the <code>examples/</code> directory showing more advanced
usage of your library.
</p>
</div>
</div>
<div id="outline-container-org08f2272" class="outline-4">
<h4 id="org08f2272"><span class="section-number-4">2.6.3</span> Creating an initial release</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
Creating an initial release of your software consists of a number of simple
steps. First, you should build the documentation by running:
</p>
<div class="org-src-container">
<pre class="src src-bash">make docs
</pre>
</div>
<p>
and next add the files in <code>docs/</code> to your repository. Edit the file
<code>CHANGELOG.md</code>, and add a release date to <code>v0.1.0</code> (change the YYYY-MM-DD).
</p>

<p>
Next, we will publish the release on GitHub. Push all your changes. Next, go to
your GitHub repository page, and click on the button saying <b>0 releases</b>, and
next on <b>create a new release</b>. You are asked to provide three things
</p>
<ul class="org-ul">
<li>The <i>tag version</i> should be v0.1.0.</li>
<li>The <i>Release title</i> can be 'Initial release'.</li>
<li>What to set as the description for this initial release is up to you, it can
for example be one or two sentences about your project.</li>
</ul>

<p>
It may be a good idea to mark your project as a pre-release until your are
confident that it is widely usable. Finally, click <b>Public release</b>. GitHub will
now create a new <i>tag</i> (but not a new commit) permanently marking this version
of your code as <code>v0.1.0</code>. Optionally, you can immediately pull this tag to your
local repository:
</p>
<div class="org-src-container">
<pre class="src src-bash">git pull --tags
</pre>
</div>
<p>
Next, we create a <code>conda</code> package:
</p>
<div class="org-src-container">
<pre class="src src-bash">make conda_package
</pre>
</div>
<p>
If you have set up your account for Anaconda uploads, you can now upload the
package, see the tail of the output of the previous command for instructions.
This will provide potential users with an easy way to install your software.
</p>
</div>
</div>
<div id="outline-container-org2b8cf33" class="outline-4">
<h4 id="org2b8cf33"><span class="section-number-4">2.6.4</span> Further development</h4>
<div class="outline-text-4" id="text-2-6-4">
<p>
As time progresses, you will most likely continue the development of your
software package. We recommend to release a minimal version of your software
early, and to release updates often. Updates to software packages come in
roughly three forms (with changes ranges from small to big). (1) <b>patches</b> are
fixes of previously released functionality that do not work according to
specifications. (2) <b>minor</b> updates add additional functionality, but old
programs written on top of your software should still function. (3) <b>major</b>
updates are those that can break existing code, by changing or removing
behaviour of a previous release.
</p>

<p>
As a service to your users, it is important to maintain <code>CHANGELOG.md</code>. Here,
you document the main changes you have made since the previous release. This is
done in the <i>Unreleased</i> section, that after a while may look like this:
</p>
<div class="org-src-container">
<pre class="src src-markdown"><span style="font-weight: bold;">##</span> <span style="font-weight: bold;">[Unreleased]</span>
<span style="font-weight: bold;">###</span> <span style="font-weight: bold;">Added</span>
<span style="font-weight: bold;">-</span> Add a function =hsp.myfunction=.
<span style="font-weight: bold;">-</span> Add another function =hsp.myotherfunction=.

<span style="font-weight: bold;">###</span> <span style="font-weight: bold;">Removed</span>
<span style="font-weight: bold;">-</span> Remove obsolete function =hsp.myoldfunction=.

<span style="font-weight: bold;">###</span> <span style="font-weight: bold;">Changed</span>
<span style="font-weight: bold;">-</span> Change default value for argument =arg= of =hsp.fn= to =None=.
</pre>
</div>
<p>
This helps make releasing new version in the future much easier. If you decide
to make a new version (again, this can already be done after a single patch: it
is important not to hoard new functionality!) then it is like the initial
release with the following changes. (1) you need to decide on a new version
number <code>vX.Y.Z</code>. This is done according to the biggest change you have made. If
this is a <b>patch</b>, <code>Z</code> is increased by one compared to the previous version, if
it is a <b>minor</b> <code>Y</code> is increased by one, otherwise <code>X</code> is increased by one. This
can be done automatically with any one of the following three commands:
</p>
<div class="org-src-container">
<pre class="src src-bash">bumpversion patch <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">increase Z</span>
bumpversion minor <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">increase Y</span>
bumpversion major <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">increase X</span>
</pre>
</div>
<p>
Next, we update <code>CHANGELOG.md</code>. Change <code>[Unreleased]</code> to <code>[X.Y.Z] - YYYY-MM-DD</code>.
Add a line at the end of the document that looks like this
</p>
<div class="org-src-container">
<pre class="src src-markdown"><span style="font-weight: bold; text-decoration: underline;">[X.Y.Z]</span>: <span style="font-style: italic;">https://github.com/username/project/compare/vX.Y.Z...vA.B.C</span>
</pre>
</div>
<p>
W here <code>vA.B.C</code>  is the version number of the previous release. This allows users
to click on the version number in the CHANGELOG and get an overview of all the
code changes since the previous release.
</p>

<p>
The remaining steps are as with the initial release. For a release <i>Description</i>
you can simply copy the section of the CHANGELOG corresponding to the new version.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan-Willem Buurlage, Allard Hendriksen</p>
<p class="date">Created: 2018-11-01 Thu 13:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
